zengyixiang/GD32H757_project_template/startup/startup_gd32h757.s
/*******************************************************************************
*
* Provide weak aliases for each Exception handler to the Default_Handler.
* As they are weak aliases, any function with the same name will override
* this definition.
*
*******************************************************************************/
   .weak      NMI_Handler
   .thumb_set NMI_Handler,Default_Handler

   .weak      HardFault_Handler
   .thumb_set HardFault_Handler,Default_Handler

   .weak      MemManage_Handler
   .thumb_set MemManage_Handler,Default_Handler

   .weak      BusFault_Handler
   .thumb_set BusFault_Handler,Default_Handler

   .weak      UsageFault_Handler
   .thumb_set UsageFault_Handler,Default_Handler

   .weak      SVC_Handler
   .thumb_set SVC_Handler,Default_Handler

   .weak      DebugMon_Handler
   .thumb_set DebugMon_Handler,Default_Handler

   .weak      PendSV_Handler
   .thumb_set PendSV_Handler,Default_Handler

   .weak      SysTick_Handler
   .thumb_set SysTick_Handler,Default_Handler

   .weak      WWDGT_IRQHandler
   .thumb_set WWDGT_IRQHandler,Default_Handler

   .weak      AVD_LVD_OVD_IRQHandler
   .thumb_set AVD_LVD_OVD_IRQHandler,Default_Handler

   .weak      TAMPER_STAMP_LXTAL_IRQHandler
   .thumb_set TAMPER_STAMP_LXTAL_IRQHandler,Default_Handler

   .weak      RTC_WKUP_IRQHandler
   .thumb_set RTC_WKUP_IRQHandler,Default_Handler

   .weak      FMC_IRQHandler
   .thumb_set FMC_IRQHandler,Default_Handler

   .weak      RCU_IRQHandler
   .thumb_set RCU_IRQHandler,Default_Handler

   .weak      EXTI0_IRQHandler
   .thumb_set EXTI0_IRQHandler,Default_Handler

   .weak      EXTI1_IRQHandler
   .thumb_set EXTI1_IRQHandler,Default_Handler

   .weak      EXTI2_IRQHandler
   .thumb_set EXTI2_IRQHandler,Default_Handler

   .weak      EXTI3_IRQHandler
   .thumb_set EXTI3_IRQHandler,Default_Handler

   .weak      EXTI4_IRQHandler
   .thumb_set EXTI4_IRQHandler,Default_Handler

   .weak      DMA0_Channel0_IRQHandler
   .thumb_set DMA0_Channel0_IRQHandler,Default_Handler

   .weak      DMA0_Channel1_IRQHandler
   .thumb_set DMA0_Channel1_IRQHandler,Default_Handler

   .weak      DMA0_Channel2_IRQHandler
   .thumb_set DMA0_Channel2_IRQHandler,Default_Handler

   .weak      DMA0_Channel3_IRQHandler
   .thumb_set DMA0_Channel3_IRQHandler,Default_Handler

   .weak      DMA0_Channel4_IRQHandler
   .thumb_set DMA0_Channel4_IRQHandler,Default_Handler

   .weak      DMA0_Channel5_IRQHandler
   .thumb_set DMA0_Channel5_IRQHandler,Default_Handler

   .weak      DMA0_Channel6_IRQHandler
   .thumb_set DMA0_Channel6_IRQHandler,Default_Handler

   .weak      ADC0_1_IRQHandler
   .thumb_set ADC0_1_IRQHandler,Default_Handler

   .weak      EXTI5_9_IRQHandler
   .thumb_set EXTI5_9_IRQHandler,Default_Handler

   .weak      TIMER0_BRK_IRQHandler
   .thumb_set TIMER0_BRK_IRQHandler,Default_Handler

   .weak      TIMER0_UP_IRQHandler
   .thumb_set TIMER0_UP_IRQHandler,Default_Handler

   .weak      TIMER0_TRG_CMT_IRQHandler
   .thumb_set TIMER0_TRG_CMT_IRQHandler,Default_Handler

   .weak      TIMER0_Channel_IRQHandler
   .thumb_set TIMER0_Channel_IRQHandler,Default_Handler

   .weak      TIMER1_IRQHandler
   .thumb_set TIMER1_IRQHandler,Default_Handler

   .weak      TIMER2_IRQHandler
   .thumb_set TIMER2_IRQHandler,Default_Handler

   .weak      TIMER3_IRQHandler
   .thumb_set TIMER3_IRQHandler,Default_Handler

   .weak      I2C0_EV_IRQHandler
   .thumb_set I2C0_EV_IRQHandler,Default_Handler

   .weak      I2C0_ER_IRQHandler
   .thumb_set I2C0_ER_IRQHandler,Default_Handler

   .weak      I2C1_EV_IRQHandler
   .thumb_set I2C1_EV_IRQHandler,Default_Handler

   .weak      I2C1_ER_IRQHandler
   .thumb_set I2C1_ER_IRQHandler,Default_Handler

   .weak      SPI0_IRQHandler
   .thumb_set SPI0_IRQHandler,Default_Handler

   .weak      SPI1_IRQHandler
   .thumb_set SPI1_IRQHandler,Default_Handler

   .weak      USART0_IRQHandler
   .thumb_set USART0_IRQHandler,Default_Handler

   .weak      USART1_IRQHandler
   .thumb_set USART1_IRQHandler,Default_Handler

   .weak      USART2_IRQHandler
   .thumb_set USART2_IRQHandler,Default_Handler

   .weak      EXTI10_15_IRQHandler
   .thumb_set EXTI10_15_IRQHandler,Default_Handler

   .weak      RTC_Alarm_IRQHandler
   .thumb_set RTC_Alarm_IRQHandler,Default_Handler

   .weak      TIMER7_BRK_IRQHandler
   .thumb_set TIMER7_BRK_IRQHandler,Default_Handler

   .weak      TIMER7_UP_IRQHandler
   .thumb_set TIMER7_UP_IRQHandler,Default_Handler

   .weak      TIMER7_TRG_CMT_IRQHandler
   .thumb_set TIMER7_TRG_CMT_IRQHandler,Default_Handler

   .weak      TIMER7_Channel_IRQHandler
   .thumb_set TIMER7_Channel_IRQHandler,Default_Handler

   .weak      DMA0_Channel7_IRQHandler
   .thumb_set DMA0_Channel7_IRQHandler,Default_Handler

   .weak      EXMC_IRQHandler
   .thumb_set EXMC_IRQHandler,Default_Handler

   .weak      SDIO0_IRQHandler
   .thumb_set SDIO0_IRQHandler,Default_Handler

   .weak      TIMER4_IRQHandler
   .thumb_set TIMER4_IRQHandler,Default_Handler

   .weak      SPI2_IRQHandler
   .thumb_set SPI2_IRQHandler,Default_Handler

   .weak      UART3_IRQHandler
   .thumb_set UART3_IRQHandler,Default_Handler

   .weak      UART4_IRQHandler
   .thumb_set UART4_IRQHandler,Default_Handler

   .weak      TIMER5_DAC_UDR_IRQHandler
   .thumb_set TIMER5_DAC_UDR_IRQHandler,Default_Handler

   .weak      TIMER6_IRQHandler
   .thumb_set TIMER6_IRQHandler,Default_Handler

   .weak      DMA1_Channel0_IRQHandler
   .thumb_set DMA1_Channel0_IRQHandler,Default_Handler

   .weak      DMA1_Channel1_IRQHandler
   .thumb_set DMA1_Channel1_IRQHandler,Default_Handler

   .weak      DMA1_Channel2_IRQHandler
   .thumb_set DMA1_Channel2_IRQHandler,Default_Handler

   .weak      DMA1_Channel3_IRQHandler
   .thumb_set DMA1_Channel3_IRQHandler,Default_Handler

   .weak      DMA1_Channel4_IRQHandler
   .thumb_set DMA1_Channel4_IRQHandler,Default_Handler

   .weak      ENET0_IRQHandler
   .thumb_set ENET0_IRQHandler,Default_Handler

   .weak      ENET0_WKUP_IRQHandler
   .thumb_set ENET0_WKUP_IRQHandler,Default_Handler

