zengyixiang/GD32H757_project_template/startup/startup_gd32h757.s
   .weak      DMA1_Channel5_IRQHandler
   .thumb_set DMA1_Channel5_IRQHandler,Default_Handler

   .weak      DMA1_Channel6_IRQHandler
   .thumb_set DMA1_Channel6_IRQHandler,Default_Handler

   .weak      DMA1_Channel7_IRQHandler
   .thumb_set DMA1_Channel7_IRQHandler,Default_Handler

   .weak      USART5_IRQHandler
   .thumb_set USART5_IRQHandler,Default_Handler

   .weak      I2C2_EV_IRQHandler
   .thumb_set I2C2_EV_IRQHandler,Default_Handler

   .weak      I2C2_ER_IRQHandler
   .thumb_set I2C2_ER_IRQHandler,Default_Handler

   .weak      USBHS0_EP1_OUT_IRQHandler
   .thumb_set USBHS0_EP1_OUT_IRQHandler,Default_Handler

   .weak      USBHS0_EP1_IN_IRQHandler
   .thumb_set USBHS0_EP1_IN_IRQHandler,Default_Handler

   .weak      USBHS0_WKUP_IRQHandler
   .thumb_set USBHS0_WKUP_IRQHandler,Default_Handler

   .weak      USBHS0_IRQHandler
   .thumb_set USBHS0_IRQHandler,Default_Handler

   .weak      DCI_IRQHandler
   .thumb_set DCI_IRQHandler,Default_Handler

   .weak      CAU_IRQHandler
   .thumb_set CAU_IRQHandler,Default_Handler

   .weak      HAU_TRNG_IRQHandler
   .thumb_set HAU_TRNG_IRQHandler,Default_Handler

   .weak      FPU_IRQHandler
   .thumb_set FPU_IRQHandler,Default_Handler

   .weak      UART6_IRQHandler
   .thumb_set UART6_IRQHandler,Default_Handler

   .weak      UART7_IRQHandler
   .thumb_set UART7_IRQHandler,Default_Handler

   .weak      SPI3_IRQHandler
   .thumb_set SPI3_IRQHandler,Default_Handler

   .weak      SPI4_IRQHandler
   .thumb_set SPI4_IRQHandler,Default_Handler

   .weak      SPI5_IRQHandler
   .thumb_set SPI5_IRQHandler,Default_Handler

   .weak      SAI0_IRQHandler
   .thumb_set SAI0_IRQHandler,Default_Handler

   .weak      TLI_IRQHandler
   .thumb_set TLI_IRQHandler,Default_Handler

   .weak      TLI_ER_IRQHandler
   .thumb_set TLI_ER_IRQHandler,Default_Handler

   .weak      IPA_IRQHandler
   .thumb_set IPA_IRQHandler,Default_Handler

   .weak      SAI1_IRQHandler
   .thumb_set SAI1_IRQHandler,Default_Handler

   .weak      OSPI0_IRQHandler
   .thumb_set OSPI0_IRQHandler,Default_Handler

   .weak      I2C3_EV_IRQHandler
   .thumb_set I2C3_EV_IRQHandler,Default_Handler

   .weak      I2C3_ER_IRQHandler
   .thumb_set I2C3_ER_IRQHandler,Default_Handler

   .weak      RSPDIF_IRQHandler
   .thumb_set RSPDIF_IRQHandler,Default_Handler

   .weak      DMAMUX_OVR_IRQHandler
   .thumb_set DMAMUX_OVR_IRQHandler,Default_Handler

   .weak      HPDF_INT0_IRQHandler
   .thumb_set HPDF_INT0_IRQHandler,Default_Handler

   .weak      HPDF_INT1_IRQHandler
   .thumb_set HPDF_INT1_IRQHandler,Default_Handler

   .weak      HPDF_INT2_IRQHandler
   .thumb_set HPDF_INT2_IRQHandler,Default_Handler

   .weak      HPDF_INT3_IRQHandler
   .thumb_set HPDF_INT3_IRQHandler,Default_Handler

   .weak      SAI2_IRQHandler
   .thumb_set SAI2_IRQHandler,Default_Handler

   .weak      TIMER14_IRQHandler
   .thumb_set TIMER14_IRQHandler,Default_Handler

   .weak      TIMER15_IRQHandler
   .thumb_set TIMER15_IRQHandler,Default_Handler

   .weak      TIMER16_IRQHandler
   .thumb_set TIMER16_IRQHandler,Default_Handler

   .weak      MDIO_IRQHandler
   .thumb_set MDIO_IRQHandler,Default_Handler

   .weak      MDMA_IRQHandler
   .thumb_set MDMA_IRQHandler,Default_Handler

   .weak      SDIO1_IRQHandler
   .thumb_set SDIO1_IRQHandler,Default_Handler

   .weak      HWSEM_IRQHandler
   .thumb_set HWSEM_IRQHandler,Default_Handler

   .weak      ADC2_IRQHandler
   .thumb_set ADC2_IRQHandler,Default_Handler

   .weak      CMP0_1_IRQHandler
   .thumb_set CMP0_1_IRQHandler,Default_Handler

   .weak      CTC_IRQHandler
   .thumb_set CTC_IRQHandler,Default_Handler

   .weak      RAMECCMU_IRQHandler
   .thumb_set RAMECCMU_IRQHandler,Default_Handler

   .weak      OSPI1_IRQHandler
   .thumb_set OSPI1_IRQHandler,Default_Handler

   .weak      RTDEC0_IRQHandler
   .thumb_set RTDEC0_IRQHandler,Default_Handler

   .weak      RTDEC1_IRQHandler
   .thumb_set RTDEC1_IRQHandler,Default_Handler

   .weak      FAC_IRQHandler
   .thumb_set FAC_IRQHandler,Default_Handler

   .weak      TMU_IRQHandler
   .thumb_set TMU_IRQHandler,Default_Handler

   .weak      TIMER22_IRQHandler
   .thumb_set TIMER22_IRQHandler,Default_Handler

   .weak      TIMER23_IRQHandler
   .thumb_set TIMER23_IRQHandler,Default_Handler

   .weak      TIMER30_IRQHandler
   .thumb_set TIMER30_IRQHandler,Default_Handler

   .weak      TIMER31_IRQHandler
   .thumb_set TIMER31_IRQHandler,Default_Handler

   .weak      TIMER40_IRQHandler
   .thumb_set TIMER40_IRQHandler,Default_Handler

   .weak      TIMER41_IRQHandler
   .thumb_set TIMER41_IRQHandler,Default_Handler

   .weak      TIMER42_IRQHandler
   .thumb_set TIMER42_IRQHandler,Default_Handler

   .weak      TIMER43_IRQHandler
   .thumb_set TIMER43_IRQHandler,Default_Handler

   .weak      TIMER44_IRQHandler
   .thumb_set TIMER44_IRQHandler,Default_Handler

   .weak      TIMER50_IRQHandler
   .thumb_set TIMER50_IRQHandler,Default_Handler

   .weak      TIMER51_IRQHandler
   .thumb_set TIMER51_IRQHandler,Default_Handler

   .weak      USBHS1_EP1_OUT_IRQHandler
   .thumb_set USBHS1_EP1_OUT_IRQHandler,Default_Handler

   .weak      USBHS1_EP1_IN_IRQHandler
   .thumb_set USBHS1_EP1_IN_IRQHandler,Default_Handler

   .weak      USBHS1_WKUP_IRQHandler
   .thumb_set USBHS1_WKUP_IRQHandler,Default_Handler

   .weak      USBHS1_IRQHandler
   .thumb_set USBHS1_IRQHandler,Default_Handler

   .weak      ENET1_IRQHandler
   .thumb_set ENET1_IRQHandler,Default_Handler

   .weak      ENET1_WKUP_IRQHandler
   .thumb_set ENET1_WKUP_IRQHandler,Default_Handler

   .weak      CAN0_WKUP_IRQHandler
   .thumb_set CAN0_WKUP_IRQHandler,Default_Handler

   .weak      CAN0_Message_IRQHandler
   .thumb_set CAN0_Message_IRQHandler,Default_Handler

   .weak      CAN0_Busoff_IRQHandler
   .thumb_set CAN0_Busoff_IRQHandler,Default_Handler

   .weak      CAN0_Error_IRQHandler
   .thumb_set CAN0_Error_IRQHandler,Default_Handler

   .weak      CAN0_FastError_IRQHandler
   .thumb_set CAN0_FastError_IRQHandler,Default_Handler

   .weak      CAN0_TEC_IRQHandler
   .thumb_set CAN0_TEC_IRQHandler,Default_Handler

   .weak      CAN0_REC_IRQHandler
   .thumb_set CAN0_REC_IRQHandler,Default_Handler

