zengyixiang/GD32H757_project_template/startup/startup_gd32h757.s
   .weak      CAN1_WKUP_IRQHandler
   .thumb_set CAN1_WKUP_IRQHandler,Default_Handler

   .weak      CAN1_Message_IRQHandler
   .thumb_set CAN1_Message_IRQHandler,Default_Handler

   .weak      CAN1_Busoff_IRQHandler
   .thumb_set CAN1_Busoff_IRQHandler,Default_Handler

   .weak      CAN1_Error_IRQHandler
   .thumb_set CAN1_Error_IRQHandler,Default_Handler

   .weak      CAN1_FastError_IRQHandler
   .thumb_set CAN1_FastError_IRQHandler,Default_Handler

   .weak      CAN1_TEC_IRQHandler
   .thumb_set CAN1_TEC_IRQHandler,Default_Handler

   .weak      CAN1_REC_IRQHandler
   .thumb_set CAN1_REC_IRQHandler,Default_Handler

   .weak      CAN2_WKUP_IRQHandler
   .thumb_set CAN2_WKUP_IRQHandler,Default_Handler

   .weak      CAN2_Message_IRQHandler
   .thumb_set CAN2_Message_IRQHandler,Default_Handler

   .weak      CAN2_Busoff_IRQHandler
   .thumb_set CAN2_Busoff_IRQHandler,Default_Handler

   .weak      CAN2_Error_IRQHandler
   .thumb_set CAN2_Error_IRQHandler,Default_Handler

   .weak      CAN2_FastError_IRQHandler
   .thumb_set CAN2_FastError_IRQHandler,Default_Handler

   .weak      CAN2_TEC_IRQHandler
   .thumb_set CAN2_TEC_IRQHandler,Default_Handler

   .weak      CAN2_REC_IRQHandler
   .thumb_set CAN2_REC_IRQHandler,Default_Handler

   .weak      EFUSE_IRQHandler
   .thumb_set EFUSE_IRQHandler,Default_Handler

   .weak      I2C0_WKUP_IRQHandler
   .thumb_set I2C0_WKUP_IRQHandler,Default_Handler

   .weak      I2C1_WKUP_IRQHandler
   .thumb_set I2C1_WKUP_IRQHandler,Default_Handler

   .weak      I2C2_WKUP_IRQHandler
   .thumb_set I2C2_WKUP_IRQHandler,Default_Handler

   .weak      I2C3_WKUP_IRQHandler
   .thumb_set I2C3_WKUP_IRQHandler,Default_Handler

   .weak      LPDTS_IRQHandler
   .thumb_set LPDTS_IRQHandler,Default_Handler

   .weak      LPDTS_WKUP_IRQHandler
   .thumb_set LPDTS_WKUP_IRQHandler,Default_Handler

   .weak      TIMER0_DEC_IRQHandler
   .thumb_set TIMER0_DEC_IRQHandler,Default_Handler

   .weak      TIMER7_DEC_IRQHandler
   .thumb_set TIMER7_DEC_IRQHandler,Default_Handler

   .weak      TIMER1_DEC_IRQHandler
   .thumb_set TIMER1_DEC_IRQHandler,Default_Handler

   .weak      TIMER2_DEC_IRQHandler
   .thumb_set TIMER2_DEC_IRQHandler,Default_Handler

   .weak      TIMER3_DEC_IRQHandler
   .thumb_set TIMER3_DEC_IRQHandler,Default_Handler

   .weak      TIMER4_DEC_IRQHandler
   .thumb_set TIMER4_DEC_IRQHandler,Default_Handler

   .weak      TIMER22_DEC_IRQHandler
   .thumb_set TIMER22_DEC_IRQHandler,Default_Handler

   .weak      TIMER23_DEC_IRQHandler
   .thumb_set TIMER23_DEC_IRQHandler,Default_Handler

   .weak      TIMER30_DEC_IRQHandler
   .thumb_set TIMER30_DEC_IRQHandler,Default_Handler

   .weak      TIMER31_DEC_IRQHandler
   .thumb_set TIMER31_DEC_IRQHandler,Default_Handler

